#写代码，有如下字典，按要求实现每一个功能，dic={'k1':'v1','k2':'v2','k3':'v3'}
#1.请循环遍历出所有的 key
#2.请循环遍历出所有的 value
#3.请循环遍历出所有的 key 和 value
#4.请在字典中添加一个键值对，'k4':'v4'，输出添加后的字典
#5.请删除字典中键值对'k1':'v1'，并输出删除后的字典
#6.请删除字典中的键'k5'对应的键值对，如果字典不存在键'k5'，则不报错，并且让其返回 None
#7.请获取字典中'k2'对应的值
#8.请获取字典中'k6'对应的值，如果字典不存在键'k5'，则不报错，并且让其返回 None
#9.现有 dic2={'k1':'v111','a':'b'}通过一行操作使dic2={'k1':'v1','k2':'v2','k3':'v3','a':'b'}
#10.组合嵌套题。
    #list=[['k':['qwe',20,{'k1':['tt',3,'1']},89],'ab']]
    #1.将列表list中的'tt'变成大写(用两种方式)
    #2.将列表中的数字3变成字符串'100'（用两种方式)
    #3.将列表中的字符串'1'变成数字101（用两种方式)
#11.按照要求实现以下功能
    #现有一个列表 li=[1,2,3,'a','b',4,'c'],有一个字典（此字典是动态生成的，你并不知道他里面有多少键值对，所以用dic={}模拟此字典），现需要完成以下操作：
    #如果该字典没有'k1'这个键，那就创建这个'k1'这个键和其对应的值（该键对应的值设置为空列表），并将列表li中的索引位为奇数对应的元素，添加到'k1'这个键对应的空列表中。
    #如果该字典有'k1'这个键，且k1对应的value 是列表类型，那就将列表 li 中的索引位为奇数对应的元素，添加到'k1'这个键对应的值中