# 【程序2】
# 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高
# 　　　于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提
# 　　　成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于
# 　　　40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于
# 　　　100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

#1.程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。
# 我的解法：LOW版本：
bonus=0
I=input("请输入当月的利润I(万元）：")
I=int(I)
if I<= 10:
    bonus=I*0.1
elif I>10 and I<20:
    bonus=10*0.1+(I-10)*0.75

elif I>=20 and I<=40:
    bonus=10*0.1+10*0.75+(I-20)*0.05
elif I>40 and I<60:
    bonus=10*0.1+10*0.75+20*0.05+(I-40)*0.03
elif I>=60 and I<=100:
    bonus = 10 * 0.1 + 10 * 0.75 + 20 * 0.05 + 20 * 0.03+(I-60)*0.015
elif I>=100:
    bonus=10 * 0.1 + 10 * 0.75 + 20 * 0.05 + 20 * 0.03+40*0.015+(I-100)*0.001
# print("当月应发奖金数为%d 万元" % bonus)


#优秀解法：
bonus1 = 100000 * 0.1
bonus2 = bonus1 + 100000 * 0.500075
bonus4 = bonus2 + 200000 * 0.5
bonus6 = bonus4 + 200000 * 0.3
bonus10 = bonus6 + 400000 * 0.15

i = int(input('input gain:\n'))
if i <= 100000:
    bonus = i * 0.1
elif i <= 200000:
    bonus = bonus1 + (i - 100000) * 0.075
elif i <= 400000:
    bonus = bonus2 + (i - 200000) * 0.05
elif i <= 600000:
    bonus = bonus4 + (i - 400000) * 0.03
elif i <= 1000000:
    bonus = bonus6 + (i - 600000) * 0.015
else:
    bonus = bonus10 + (i - 1000000) * 0.01
print( 'bonus = ',bonus)